package telegrambot.config.banner;

import org.springframework.boot.Banner;
import org.springframework.core.env.Environment;

import java.io.PrintStream;

public class MazhoBotBanner implements Banner {

    @Override
    public void printBanner(Environment environment, Class<?> sourceClass, PrintStream out) {
        try {
            out.println(getBanner());
        } catch (Exception e) {
            out.println(getDefBanner());
        } finally {
            out.println("\n                  \033[0;33mCOPYRIGHT \033[1;33m©2023\033[0m https://github.com/BerserkrMM/wallet-bot\n\n");
        }
    }

    private String getBanner() {
        return " ˍˍˍˍˍˍˍˍˍˍˍˍ   ˍˍˍˍˍˍˍˍ  ˍˍˍˍˍˍˍˍ  ˍˍˍ  ˍˍˍ  ˍˍˍˍˍˍˍˍ          ˍˍˍˍˍˍˍˍ  ˍˍˍˍˍˍˍˍ  ˍˍˍˍˍˍˍˍˍˍ\n" +
                "|\\   ˍˍ   ˍˍ  \\|\\   ˍˍ  \\|\\ˍˍˍˍˍ  \\|\\  \\|\\  \\|\\   ˍˍ  \\        |\\   ˍˍ  \\|\\   ˍˍ  \\|\\ˍˍˍ   ˍˍˍ\\\n" +
                "| \\  \\ |\\ˍˍ\\\\  \\ \\  \\|\\  \\|    /  /| \\  \\ \\  \\ \\  \\|\\  \\       | \\  \\|\\ /\\ \\  \\|\\  \\|   |\\  \\ |\n" +
                "|  \\  \\||  | \\  \\ \\   ˍˍ  \\   /  / |  \\   ˍˍ  \\ \\  \\ \\  \\      |  \\   ˍˍ  \\ \\  \\ \\  \\   | \\  \\|\n" +
                "|   \\  \\|  |  \\  \\ \\  \\ \\  \\ /  /ˍˍ|ˍ  \\  \\ \\  \\ \\  \\ \\  \\     |   \\  \\|\\  \\ \\  \\ \\  \\  |  \\  \\\n" +
                "|    \\ˍˍ\\  |   \\ˍˍ\\ \\ˍˍ\\ \\ˍˍ\\\\ˍˍˍˍˍˍˍˍ\\ \\ˍˍ\\ \\ˍˍ\\ \\ˍˍˍˍˍˍˍ\\    |    \\ˍˍˍˍˍˍˍ\\ \\ˍˍˍˍˍˍˍ\\ |   \\ˍˍ\\\n" +
                "|    |\033[46m  \033[0m|  |   |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m|    |    |\033[46m       \033[0m| |\033[46m       \033[0m| |   |\033[46m  \033[0m|\n" +
                "\\    |\033[46m  \033[0m|  |   |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m|    \\    |\033[46m       \033[0m| |\033[46m       \033[0m|ˍ|   |\033[46m  \033[0m|\n" +
                " \\   |\033[46m  \033[0m|ˍˍ|   |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m|     \\   |\033[46m       \033[0m| |\033[46m       \033[0m| \\   |\033[46m  \033[0m|\n" +
                "  \\  |\033[46m  \033[0m|   \\  |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m|      \\  |\033[46m       \033[0m| |\033[46m       \033[0m|  \\  |\033[46m  \033[0m|\n" +
                "   \\ |\033[46m  \033[0m|    \\ |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m| |\033[46m  \033[0m| |\033[46m  \033[0m| |\033[46m       \033[0m|       \\ |\033[46m       \033[0m| |\033[46m       \033[0m|   \\ |\033[46m  \033[0m|\n" +
                "    \\|\033[46m  \033[0m|     \\|\033[46m  \033[0m|\\|\033[46m  \033[0m|\\|\033[46m  \033[0m|\\|\033[46m       \033[0m|\\|\033[46m  \033[0m|\\|\033[46m  \033[0m|\\|\033[46m       \033[0m|        \\|\033[46m       \033[0m|\\|\033[46m       \033[0m|    \\|\033[46m  \033[0m|\n" +
                "      ¯¯        ¯¯   ¯¯   ¯¯   ¯¯¯¯¯¯¯   ¯¯   ¯¯   ¯¯¯¯¯¯¯           ¯¯¯¯¯¯¯   ¯¯¯¯¯¯¯       ¯¯ ";
    }

    private String getDefBanner() {
        return " ˍˍˍˍˍˍˍˍˍˍˍˍ   ˍˍˍˍˍˍˍˍ  ˍˍˍˍˍˍˍˍ  ˍˍˍ  ˍˍˍ  ˍˍˍˍˍˍˍˍ          ˍˍˍˍˍˍˍˍ  ˍˍˍˍˍˍˍˍ  ˍˍˍˍˍˍˍˍˍˍ\n" +
                "|\\   ˍˍ   ˍˍ  \\|\\   ˍˍ  \\|\\ˍˍˍˍˍ  \\|\\  \\|\\  \\|\\   ˍˍ  \\        |\\   ˍˍ  \\|\\   ˍˍ  \\|\\ˍˍˍ   ˍˍˍ\\\n" +
                "| \\  \\ |\\ˍˍ\\\\  \\ \\  \\|\\  \\|    /  /| \\  \\ \\  \\ \\  \\|\\  \\       | \\  \\|\\ /\\ \\  \\|\\  \\|   |\\  \\ |\n" +
                "|  \\  \\||  | \\  \\ \\   ˍˍ  \\   /  / |  \\   ˍˍ  \\ \\  \\ \\  \\      |  \\   ˍˍ  \\ \\  \\ \\  \\   | \\  \\|\n" +
                "|   \\  \\|  |  \\  \\ \\  \\ \\  \\ /  /ˍˍ|ˍ  \\  \\ \\  \\ \\  \\ \\  \\     |   \\  \\|\\  \\ \\  \\ \\  \\  |  \\  \\\n" +
                "|    \\ˍˍ\\  |   \\ˍˍ\\ \\ˍˍ\\ \\ˍˍ\\\\ˍˍˍˍˍˍˍˍ\\ \\ˍˍ\\ \\ˍˍ\\ \\ˍˍˍˍˍˍˍ\\    |    \\ˍˍˍˍˍˍˍ\\ \\ˍˍˍˍˍˍˍ\\ |   \\ˍˍ\\\n" +
                "|    |  |  |   |  | |  | |  | |       | |  | |  | |       |    |    |       | |       | |   |  |\n" +
                "\\    |  |  |   |  | |  | |  | |       | |  | |  | |       |    \\    |       | |       |ˍ|   |  |\n" +
                " \\   |  |ˍˍ|   |  | |  | |  | |       | |  | |  | |       |     \\   |       | |       | \\   |  |\n" +
                "  \\  |  |   \\  |  | |  | |  | |       | |  | |  | |       |      \\  |       | |       |  \\  |  |\n" +
                "   \\ |  |    \\ |  | |  | |  | |       | |  | |  | |       |       \\ |       | |       |   \\ |  |\n" +
                "    \\|ˍˍ|     \\|ˍˍ|\\|ˍˍ|\\|ˍˍ|\\|ˍˍˍˍˍˍˍ|\\|ˍˍ|\\|ˍˍ|\\|ˍˍˍˍˍˍˍ|        \\|ˍˍˍˍˍˍˍ|\\|ˍˍˍˍˍˍˍ|    \\|ˍˍ|\n";
    }
}
